Revit 2027 API
Transaction.HasEnded Method
 Determines whether the transaction has ended already.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool HasEnded()
Public Function HasEnded As Boolean
public:
bool HasEnded()
member HasEnded : unit -> bool
Return Value
Boolean
 True if the transaction has already been committed or rolled back, False otherwise.
Remarks
 A transaction is ended by completing either the 'Commit' or 'RollBack' method. Another way of testing whether a transaction has ended is by testing the current status (see GetStatus()). It must be either 'TransactionStatus.Committed' or 'TransactionStatus.RolledBack'
See Also
Reference
Transaction Class
Autodesk.Revit.DB Namespace